backend/controllers/AdminRoleController.php

SELECT * FROM `admin_role` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = AdminRole::findOne($id)) !== null) {