backend/controllers/AdminPrivilegeController.php

SELECT `privilege` FROM `admin_privilege` WHERE `menu_id`='transaction'
---
  function actionIndex($role=0) {
    $listMenu = (new \yii\db\Query())
                ->select(['menu_id'])
                ->from('admin_access')
                ->where(['role_id' => $role])
                ->all();
    $menu = [];
    $privilege = [];
    foreach($listMenu as $listMenu) {
      $menu[] = $listMenu['menu_id'];
      $listPrivilege = (new \yii\db\Query())
                        ->select(['privilege'])
                        ->from('admin_privilege')
                        ->where(['role_id' => $role])
                        ->where(['menu_id' => $listMenu['menu_id']])
                        ->all();
      if(!empty($listPrivilege)) {
        foreach($listPrivilege as $listPrivilege) {
          if(!empty($listPrivilege['privilege'])) {
            $im_privilege = explode(',', $listPrivilege['privilege']);
            $privilege[$listMenu['menu_id']] = $im_privilege;
          }
        }
      }
    }
    $listJobType = (new \yii\db\Query())
                    ->select(['job_type_id','job_description'])
                    ->from('job_type')
                    ->all();