backend/controllers/AdminPrivilegeController.php

SELECT `name` FROM `admin_role` WHERE `id`='6'
SELECT `menu_id`, `country` FROM `admin_access` WHERE `role_id`='6'
SELECT `privilege` FROM `admin_privilege` WHERE (`role_id`='6') AND (`menu_id`='bio-unread')
---
  function actionIndex($role=0) {
    $rolename = (new \yii\db\Query())
                ->select(['name'])
                ->from('admin_role')
                ->where(['id' => $role])
                ->one();
    $listMenu = (new \yii\db\Query())
                ->select(['menu_id', 'country'])
                ->from('admin_access')
                ->where(['role_id' => $role])
                ->all();
    $menu = [];
    $privilege = [];
    $pricountry = [];
    foreach($listMenu as $listMenu) {
      $menu[] = $listMenu['menu_id'];
      $pricountry[$listMenu['menu_id']] = $listMenu['country'];
      $listPrivilege = (new \yii\db\Query())
                        ->select(['privilege'])
                        ->from('admin_privilege')
                        ->where(['role_id' => $role])
                        ->andWhere(['menu_id' => $listMenu['menu_id']])
                        ->all();

SELECT `job_type_id`, `job_description` FROM `job_type`
---
        }
      }
    }
    $listJobType = (new \yii\db\Query())
                    ->select(['job_type_id','job_description'])
                    ->from('job_type')
                    ->all();

SELECT `country_id`, `description` FROM `country`
---
      $jobType[] = $listJobType['job_type_id'].'-'.$listJobType['job_description'];
    }
    $countJobType = count($jobType);
    $listCountry = (new \yii\db\Query())
                    ->select(['country_id','description'])
                    ->from('country')
                    ->all();

DELETE FROM `admin_access` WHERE `role_id`='6'
DELETE FROM `admin_privilege` WHERE `role_id`='6'
INSERT INTO `admin_access` (`role_id`, `menu_id`) VALUES (6, 'bio-unread')
INSERT INTO `admin_access` (`role_id`, `menu_id`, `country`) VALUES (6, 'bio-unread?id=2', 'ALJ')
---
  function actionAdd($role=0) {
    $request = Yii::$app->request;
    AdminAccess::deleteAll(['role_id' =>  $role]);
    AdminPrivilege::deleteAll(['role_id' =>  $role]);

    // Variable Post
    $menu       = $request->post('menu');
    if(!empty($menu)) {
      $count_menu = count($menu);
      for($u=0;$u<$count_menu;$u++) {
        $modelAccess = new AdminAccess;
        $modelAccess->role_id = $role;
        $modelAccess->menu_id = $menu[$u];
        $modelAccess->save();
      }
    }
    $submenu    = $request->post('submenu');
    if(!empty($submenu)) {
      $count_sub  = count($submenu);
      for($i=0;$i<$count_sub;$i++) {
        $modelAccess = new AdminAccess;
        $modelAccess->role_id = $role;
        $modelAccess->menu_id = $submenu[$i];
        $country = $request->post('country-'.$submenu[$i]);
        if(!empty($country)) {
          $modelAccess->country = $country;
        }
        $modelAccess->save();