backend/controllers/BioTrashController.php

SELECT `job_post_activity`.`apply_date`, `applicant`.`name`, `applicant`.`phone`, `job_post_activity`.`job_priority`, `applicant`.`address`, `job_post_activity`.`id`, `user_admin`.`first_name`, `user_admin`.`last_name`, `user_admin`.`username` FROM `job_post_activity` INNER JOIN `applicant` ON applicant.user_account_id = job_post_activity.user_account_id INNER JOIN `job_post` ON job_post.job_post_id = job_post_activity.job_post_id LEFT JOIN `user_admin` ON user_admin.id = job_post_activity.admin_by WHERE (`job_post`.`job_type_id`='4') AND (`job_post_activity`.`step`=2) AND (`job_post_activity`.`trash`=1) AND (`job_post_activity`.`recall`=0)
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id`='4'
---
  function actionIndex($id=0) {
    $model = new JobPostActivity;
    // Get Data Job Post Activity
    $dataJobPostActivity =  (new \yii\db\Query())
                            ->select(['job_post_activity.apply_date', 'applicant.name',
                            'applicant.phone', 'job_post_activity.job_priority', 'applicant.address',
                            'job_post_activity.id', 'user_admin.first_name', 'user_admin.last_name', 'user_admin.username'])
                            ->from('job_post_activity')
                            ->join('INNER JOIN', 'applicant', 'applicant.user_account_id = job_post_activity.user_account_id')
                            ->join('INNER JOIN', 'job_post', 'job_post.job_post_id = job_post_activity.job_post_id')
                            ->join('LEFT JOIN', 'user_admin', 'user_admin.id = job_post_activity.admin_by')
                            ->where(['job_post.job_type_id'  =>  $id])
                            ->andWhere(['job_post_activity.step' => 2])
                            ->andWhere(['job_post_activity.trash' => 1])
                            ->andWhere(['job_post_activity.recall' => 0])
                            ->all();
    $dataJobType         =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['job_type_id' =>  $id])
                            ->one();

SELECT * FROM `admin_privilege` WHERE (`role_id`=1) AND (`menu_id`='bio-trash?id=4')
---
    if(!empty(Yii::$app->controller->actionParams['id'])) {
      $param_id = Yii::$app->controller->actionParams['id'];
      $request_now = $controller."?id=".$param_id;
      $listPrivilege = (new \yii\db\Query())
                        ->select(['*'])
                        ->from('admin_privilege')
                        ->where(['role_id' => Yii::$app->user->identity->role])
                        ->andWhere(['menu_id' => $request_now])
                        ->one();