backend/controllers/BioUnreadController.php

  function actionIndex($id=0) {
    $model = new JobPostActivity;
    // Get Data Job Post Activity
    $dataJobPostActivity =  (new \yii\db\Query())
                            ->select(['job_post_activity.apply_date', 'applicant.name',
                            'applicant.phone', 'job_post_activity.job_priority', 'applicant.address',
                            'job_post_activity.id'])
                            ->from('job_post_activity')
                            ->join('INNER JOIN', 'applicant', 'applicant.user_account_id = job_post_activity.user_account_id')
                            ->join('INNER JOIN', 'job_post', 'job_post.job_post_id = job_post_activity.job_post_id')
                            ->where(['job_post.job_type_id'  =>  $id])
                            ->andWhere(['job_post_activity.step' => 0])
                            ->all();
    $dataJobType         =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['job_type_id' =>  $id])
                            ->one();
    $otherJobType        =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['!=', 'job_type_id', $id])
                            ->all();
---
SELECT `job_post_activity`.`apply_date`, `applicant`.`name`, `applicant`.`phone`, `job_post_activity`.`job_priority`, `applicant`.`address`, `job_post_activity`.`id` FROM `job_post_activity` INNER JOIN `applicant` ON applicant.user_account_id = job_post_activity.user_account_id INNER JOIN `job_post` ON job_post.job_post_id = job_post_activity.job_post_id WHERE (`job_post`.`job_type_id`='1') AND (`job_post_activity`.`step`=0)
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id`='1'
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id` != '1'