backend/controllers/BioUnreadController.php

SELECT `job_post_activity`.`apply_date`, `applicant`.`name`, `applicant`.`phone`, `job_post_activity`.`job_priority`, `applicant`.`address`, `job_post_activity`.`id` FROM `job_post_activity` INNER JOIN `applicant` ON applicant.user_account_id = job_post_activity.user_account_id INNER JOIN `job_post` ON job_post.job_post_id = job_post_activity.job_post_id WHERE (`job_post`.`job_type_id`='3') AND (`job_post_activity`.`step`=0)
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id`='7'
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id` != '7'
---
  function actionIndex($id=0) {
    $model = new JobPostActivity;
    // Get Data Job Post Activity
    $dataJobPostActivity =  (new \yii\db\Query())
                            ->select(['job_post_activity.apply_date', 'applicant.name',
                            'applicant.phone', 'job_post_activity.job_priority', 'applicant.address',
                            'job_post_activity.id'])
                            ->from('job_post_activity')
                            ->join('INNER JOIN', 'applicant', 'applicant.user_account_id = job_post_activity.user_account_id')
                            ->join('INNER JOIN', 'job_post', 'job_post.job_post_id = job_post_activity.job_post_id')
                            ->where(['job_post.job_type_id'  =>  $id])
                            ->andWhere(['job_post_activity.step' => 0])
                            ->all();
    $dataJobType         =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['job_type_id' =>  $id])
                            ->one();
    $otherJobType        =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['!=', 'job_type_id', $id])
                            ->all();

SELECT * FROM `job_post_activity` WHERE `id`='1'
---
  function actionReject($id=0,$menu=0) {
    $model = JobPostActivity::findOne($id);

SELECT * FROM `job_post_activity` WHERE `id`='3'
UPDATE `job_post_activity` SET `status_read`=1, `step`=2, `move_job_type_id`=4, `accept`=1, `admin_by`='5' WHERE `id`=3
---
  function actionAcceptojt($id=0, $menu=0) {
    $request = Yii::$app->request;
    $model = JobPostActivity::findOne($id);
    $model->status_read = 1;
    $model->step = 2;
    $model->move_job_type_id = $request->post('job');
    $model->accept = 1;
    $model->admin_by = Yii::$app->user->identity->id;
    $model->save();