backend/controllers/BioUnreadController.php

SELECT * FROM `admin_privilege` WHERE (`role_id`=6) AND (`menu_id`='bio-unread?id=4')
SELECT * FROM `admin_access` WHERE (`role_id`=6) AND (`menu_id`='bio-unread?id=4')
SELECT `job_post_activity`.`apply_date`, `applicant`.`name`, `applicant`.`phone`, `job_post_activity`.`job_priority`, `applicant`.`address`, `job_post_activity`.`id` FROM `job_post_activity` INNER JOIN `applicant` ON applicant.user_account_id = job_post_activity.user_account_id INNER JOIN `job_post` ON job_post.job_post_id = job_post_activity.job_post_id INNER JOIN `job_location` ON job_location.job_location_id = job_post.job_location_id WHERE (`job_post`.`job_type_id`='7') AND (`job_post_activity`.`step`=0) AND (`job_location`.`country_id`='HKD')
SELECT `job_post_activity`.`apply_date`, `applicant`.`name`, `applicant`.`phone`, `job_post_activity`.`job_priority`, `applicant`.`address`, `job_post_activity`.`id` FROM `job_post_activity` INNER JOIN `applicant` ON applicant.user_account_id = job_post_activity.user_account_id INNER JOIN `job_post` ON job_post.job_post_id = job_post_activity.job_post_id WHERE (`job_post`.`job_type_id`='4') AND (`job_post_activity`.`step`=0)
---
  function actionIndex($id=0) {
    if(!empty(Yii::$app->controller->actionParams['id'])) {
      $controller = Yii::$app->controller->id;
      $param_id = Yii::$app->controller->actionParams['id'];
      $request_now = $controller."?id=".$param_id;
      $listPrivilege = (new \yii\db\Query())
                        ->select(['*'])
                        ->from('admin_privilege')
                        ->where(['role_id' => Yii::$app->user->identity->role])
                        ->andWhere(['menu_id' => $request_now])
                        ->one();
      $access = (new \yii\db\Query())
                ->select(['*'])
                ->from('admin_access')
                ->where(['role_id' => Yii::$app->user->identity->role])
                ->andWhere(['menu_id' => $request_now])
                ->one();
      $country = $access['country'];
    }
    $privilege = explode(',', $listPrivilege['privilege']);
    // Get Data Job Post Activity
    $model = new JobPostActivity;
    if(!empty($country)) {
      if($country != 'ALL') {
        $dataJobPostActivity =  (new \yii\db\Query())
                                ->select(['job_post_activity.apply_date', 'applicant.name',
                                'applicant.phone', 'job_post_activity.job_priority', 'applicant.address',
                                'job_post_activity.id'])
                                ->from('job_post_activity')
                                ->join('INNER JOIN', 'applicant', 'applicant.user_account_id = job_post_activity.user_account_id')
                                ->join('INNER JOIN', 'job_post', 'job_post.job_post_id = job_post_activity.job_post_id')
                                ->join('INNER JOIN', 'job_location', 'job_location.job_location_id = job_post.job_location_id')
                                ->where(['job_post.job_type_id'  =>  $id])
                                ->andWhere(['job_post_activity.step' => 0])
                                ->andWhere(['job_location.country_id' => $country])
                                ->all();
      } else {
        $dataJobPostActivity =  (new \yii\db\Query())
                                ->select(['job_post_activity.apply_date', 'applicant.name',
                                'applicant.phone', 'job_post_activity.job_priority', 'applicant.address',
                                'job_post_activity.id'])
                                ->from('job_post_activity')
                                ->join('INNER JOIN', 'applicant', 'applicant.user_account_id = job_post_activity.user_account_id')
                                ->join('INNER JOIN', 'job_post', 'job_post.job_post_id = job_post_activity.job_post_id')
                                ->where(['job_post.job_type_id'  =>  $id])
                                ->andWhere(['job_post_activity.step' => 0])
                                ->all();

SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id`='4'
SELECT `job_description`, `job_type_id` FROM `job_type` WHERE `job_type_id` != '4'
---
                              ->all();
    }

    $dataJobType         =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['job_type_id' =>  $id])
                            ->one();
    $otherJobType        =  (new \yii\db\Query())
                            ->select(['job_description', 'job_type_id'])
                            ->from('job_type')
                            ->where(['!=', 'job_type_id', $id])
                            ->all();