backend/controllers/UserAdminController.php

SELECT * FROM `user_admin` WHERE `id`='13'
---
    protected function findModel($id)
    {
        if (($model = UserAdmin::findOne($id)) !== null) {