backend/views/user-admin/_form-update.php


    <?= $form->field($model, 'email')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'role')->dropDownList(
      ArrayHelper::map(AdminRole::find()->all(),'id','name'),
      ['prompt'=>'Select Role']
      )?>
---
SELECT * FROM `admin_role`