backend/views/user-admin/_form-create.php

SELECT * FROM `admin_role`
---

    <?= $form->field($model, 'email')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'role')->dropDownList(
      ArrayHelper::map(AdminRole::find()->all(),'id','name'),
      ['prompt'=>'Select Role']
      )?>