backend/views/layouts/main.php

use backend\models\JobType;

// Get List Job Type
$listJobType = (new \yii\db\Query())
                ->select(['job_type_id','job_description'])
                ->from('job_type')
                ->all();
---
SELECT `job_type_id`, `job_description` FROM `job_type`


// Get Admin Menu Access
if(!empty(Yii::$app->user->identity->id)) {
  $listMenuAccess = (new \yii\db\Query())
                    ->select(['menu_id'])
                    ->from('admin_access')
                    ->where(['role_id' =>  Yii::$app->user->identity->role])
                    ->all();
---
SELECT `menu_id` FROM `admin_access` WHERE `role_id`=1